bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
#define LBS_UUID_BASE        {0x23, 0xD1, 0xBC, 0xEA, 0x5F, 0x78, 0x23, 0x15, \
                              0xDE, 0xEF, 0x12, 0x12, 0x00, 0x00, 0x00, 0x00}
#define LBS_UUID_SERVICE     0x1523
#define LBS_UUID_BUTTON_CHAR 0x1524
#define LBS_UUID_LED_CHAR    0x1525

BLE_BILL_DEF(m_bill);
NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */

// BLE Data, declare and Initialize
//using these names, button, led for now to help me with refactored SDK code, but led will becomes command from phone to robot, button will become robot to phone logging
static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */
uint8_t g_inbyte = 0;
uint16_t svc_handle;
ble_gatts_char_handles_t button_handle, led_handle;
uint8_t uuid_type;
uint8_t led_value = 0, button_value = 0;  
//BLE prototype functions
static void timers_init(void);
static void log_init(void);
static void ble_stack_init(void);
static void gap_params_init(void);
static void gatt_init(void);
static void services_init(void);
static void advertising_init(void);
static void conn_params_init(void);
static void advertising_start(void);
static uint32_t add_second_char(void);
static uint32_t add_first_char(void);
uint32_t update_remote_byte(void);    //sends button_value
void ble_bill_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_context);

//FFT defines
#define GRAPH_WINDOW_HEIGHT              20                              //!< Graph window height used in draw function.
#define FPU_EXCEPTION_MASK               0x0000009F                      //!< FPU exception mask used to clear exceptions in FPSCR register.
#define FPU_FPSCR_REG_STACK_OFF          0x40                            //!< Offset of FPSCR register stacked during interrupt handling in FPU part stack.
// We want to use 44100 Hz sampling rate to reach 22050Hz band. 128 (64 pairs) samples are used
// in FFT calculation with result contains 64 bins (22050Hz/64bins -> ~344,5Hz per bin).
#define FFT_TEST_SAMPLE_FREQ_HZ          44100.0f                        //!< Frequency of complex input samples.
#define FFT_TEST_COMP_SAMPLES_LEN        128                             //!< Complex numbers input data array size. Correspond to FFT calculation this number must be power of two starting from 2^5 (2^4 pairs) with maximum value 2^13 (2^12 pairs).
//#define FFT_TEST_OUT_SAMPLES_LEN         (FFT_TEST_COMP_SAMPLES_LEN / 2) //!< Output array size.
//#define SIGNALS_RESOLUTION               100.0f                          //!< Sine wave frequency and noise amplitude resolution. To count resolution as decimal places in number use this formula: resolution = 1/SIGNALS_RESOLUTION .
//#define SINE_WAVE_FREQ_MAX               20000                           //!< Maximum frequency of generated sine wave.
//#define NOISE_AMPLITUDE                  1                               //!< Amplitude of generated noise added to signal.
static uint32_t  m_ifft_flag             = 0;                            //!< Flag that selects forward (0) or inverse (1) transform.
static uint32_t  m_do_bit_reverse        = 1;                            //!< Flag that enables (1) or disables (0) bit reversal of output.
static float32_t m_fft_input_f32[FFT_TEST_COMP_SAMPLES_LEN];             //!< FFT input array. Time domain.
static float32_t m_fft_output_f32[FFT_TEST_COMP_SAMPLES_LEN];             //!< FFT output data. Frequency domain.
void afunc(void);

//Microphone
//#define SAMPLE_BUFFER_CNT 8096
#define SAMPLE_BUFFER_CNT 256
int16_t p_rx_buffer[SAMPLE_BUFFER_CNT];
void configure_microphone(void);
void audio_handler(nrf_drv_pdm_evt_t const * const evt);

//Distance sensor
#define TWI_INSTANCE_ID 0
volatile bool m_xfer_done = false;
const nrf_drv_twi_t m_twi = NRF_DRV_TWI_INSTANCE(TWI_INSTANCE_ID);
void configure_VLX6180(void);
void VLX6180_init(void);
void twi_init(void);

//UART
uint8_t sendbuffer[64];
uint8_t recvbuffer[64];
void uart_init(void);
void sendbytes(uint8_t a);
void TxUART(uint8_t* buf);

//Motors
void configure_motors(void);
void motors_forward(void);
void motors_backward(void);
void motors_right(void);
void motors_left(void);
void pwm_motor_stepping(uint32_t steps_per_second);
void stop_stepping(void);
void stepping_mode(uint8_t mode);
void step_mode_experiment(void);

//Buzzer
void pwm_buzzer_frequency(float freq);
void stop_buzzer(void);

//General
void my_configure(void);
void cb_test(void);
void mb_test(void);

/**
 * Motor might be 15 degrees per step, so 24 steps per revolution.
 * 83.3rpm = 15ms * 2 = 30ms period, 33Hz/24*60s
 */
int main(void)
{
    static uint8_t range, buf[64];
    int16_t i;
    uint32_t cnt, cnt2;
    float freq[8] = { 440.0, 460.0, 470.0, 480.0, 2600, 2300, 2100, 1800 };
    ret_code_t ret;

    nrf_gpio_cfg_output(GREEN_LED);
    nrf_gpio_pin_clear(GREEN_LED);
    nrf_gpio_cfg_output(SLEEP);
    nrf_gpio_pin_set(SLEEP);
    
    #if CB_TEST
      cb_test();
    #else
      configure_VLX6180();
      uart_init();
    #endif
    #if MB_TEST
      mb_test();
    #endif

    #if SPARKFUN
      configure_microphone();
    #endif

    // Initialize.
    timers_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
 
    advertising_start();

    configure_motors();
    stepping_mode(1);
 
    my_configure();
   
 
    #if SPARKFUN
    //like 6700 samples in p_rx_buffer
    m_xfer_done = false;
    nrf_drv_pdm_buffer_set(p_rx_buffer, SAMPLE_BUFFER_CNT);
    nrf_drv_pdm_start();
    nrf_delay_ms(400);
    nrf_drv_pdm_stop();
    afunc();            //do fft, then check m_fft_output_f32 64 bytes
    #endif
   
    nrf_delay_ms(5000);     //wait 5 seconds, let me connect BLE
  
    //switch interval is 1 second
    cnt = 0;
    for (;;)
    {
          ++cnt;
          if (cnt > 7)
            cnt = 1;
          switch(cnt)
          {
          case 1:
            pwm_motor_stepping(150);    //go forward
            //pwm_buzzer_frequency(1000);
            break;
          case 2:
            //pwm_buzzer_frequency(2000);
            stop_stepping();
            motors_right();
            break;
          case 3:
            pwm_motor_stepping(100);    //turn right
            //pwm_buzzer_frequency(3000);
            break;
          case 4:
            stop_stepping();
            motors_forward();
            //stop_buzzer();
            pwm_motor_stepping(200);    //go forward
            break;
          case 5:
            stop_stepping();
            motors_right();
            break;
          case 6:
            pwm_motor_stepping(100);    //turn right
            break;
         case 7:
            stop_stepping();
            motors_forward();
            cnt = 0;
            break;
         default:
            stop_stepping();
            break;
        }
        range = getDistance();
        sprintf(buf,"Distance is %d\r\n",range);
        TxUART(buf);
        nrf_delay_ms(1000);
        nrf_gpio_pin_set(GREEN_LED);
    
      // if (NRF_LOG_PROCESS() == false)
        {
            //power_manage();
        }
    }  
}

void configure_microphone(void)
{
  nrf_gpio_cfg_output(MIC_SEL);
  nrf_gpio_pin_clear(MIC_SEL);    //Select Left Channel

  nrf_drv_pdm_config_t pdm_config = NRF_DRV_PDM_DEFAULT_CONFIG(MIC_CLK,MIC_DI);

  pdm_config.clock_freq = NRF_PDM_FREQ_1067K;
  pdm_config.mode = NRF_PDM_MODE_MONO;
  pdm_config.edge = NRF_PDM_EDGE_LEFTRISING;
  pdm_config.gain_l = NRF_PDM_GAIN_DEFAULT;
  pdm_config.gain_r = NRF_PDM_GAIN_DEFAULT;

