bweiler/Skoobot-firmware/nRF5_SDK_14.2.0_17b948a/examples/ble_peripheral/ble_app_template/main.c
    nrf_delay_ms(500);
  }

}

void stop_buzzer(void)
{
  NRF_PWM0->TASKS_STOP = 1;
}

void stop_stepping(void)
{
  NRF_PWM1->TASKS_STOP = 1;
}

void uart_init(void)
{
  NRF_UARTE0->BAUDRATE = 0x00275000; //9600bps
  NRF_UARTE0->PSEL.RXD = UART_RX_PIN;
  NRF_UARTE0->PSEL.TXD = UART_TX_PIN;
  NRF_UARTE0->TXD.PTR = sendbuffer;
  NRF_UARTE0->RXD.PTR = recvbuffer;
  NRF_UARTE0->TXD.MAXCNT = 20;
  NRF_UARTE0->RXD.MAXCNT = 20;
  NRF_UARTE0->CONFIG = 0;  //Enable  stop bit, no parity
  NRF_UARTE0->ENABLE = 8;
}

void my_configure(void)
{

  NRF_PWM1->PSEL.OUT[0] = (STEP << PWM_PSEL_OUT_PIN_Pos) | (PWM_PSEL_OUT_CONNECT_Connected << PWM_PSEL_OUT_CONNECT_Pos);
  NRF_PWM1->ENABLE = (PWM_ENABLE_ENABLE_Enabled << PWM_ENABLE_ENABLE_Pos);
  NRF_PWM1->MODE = (PWM_MODE_UPDOWN_Up << PWM_MODE_UPDOWN_Pos);
  NRF_PWM1->PRESCALER = (PWM_PRESCALER_PRESCALER_DIV_128 << PWM_PRESCALER_PRESCALER_Pos);
  NRF_PWM1->LOOP = (PWM_LOOP_CNT_Disabled << PWM_LOOP_CNT_Pos);
  NRF_PWM1->DECODER = (PWM_DECODER_LOAD_Common << PWM_DECODER_LOAD_Pos) | (PWM_DECODER_MODE_RefreshCount << PWM_DECODER_MODE_Pos);
  NRF_PWM1->SEQ[0].REFRESH = 0;
  NRF_PWM1->SEQ[0].ENDDELAY = 0;
#if CB_TEST == 0
  nrf_gpio_cfg_output(BUZZER_10MM);
  nrf_gpio_pin_clear(BUZZER_10MM);
  NRF_PWM0->PSEL.OUT[0] = (BUZZER_10MM << PWM_PSEL_OUT_PIN_Pos) | (PWM_PSEL_OUT_CONNECT_Connected << PWM_PSEL_OUT_CONNECT_Pos);
  NRF_PWM0->ENABLE = (PWM_ENABLE_ENABLE_Enabled << PWM_ENABLE_ENABLE_Pos);
  NRF_PWM0->MODE = (PWM_MODE_UPDOWN_Up << PWM_MODE_UPDOWN_Pos);
  NRF_PWM0->PRESCALER = (PWM_PRESCALER_PRESCALER_DIV_128 << PWM_PRESCALER_PRESCALER_Pos);
  NRF_PWM0->LOOP = (PWM_LOOP_CNT_Disabled << PWM_LOOP_CNT_Pos);
  NRF_PWM0->DECODER = (PWM_DECODER_LOAD_Common << PWM_DECODER_LOAD_Pos) | (PWM_DECODER_MODE_RefreshCount << PWM_DECODER_MODE_Pos);
  NRF_PWM0->SEQ[0].REFRESH = 0;
  NRF_PWM0->SEQ[0].ENDDELAY = 0;
#endif
}

// 32 microstep M1 high, M0 high-z
//
//
//
//
void configure_motors(void)
{
    nrf_gpio_cfg_output(STEP);
    nrf_gpio_cfg_output(DIR_L);
    nrf_gpio_cfg_output(DIR_R);
 
    stepping_mode(0);

    nrf_gpio_pin_clear(STEP);
    nrf_gpio_pin_set(DIR_L);
    nrf_gpio_pin_clear(DIR_R);
 }


void charging(void)
{
    for (;;)
    {
        nrf_gpio_pin_set(GREEN_LED);
        nrf_delay_ms(500);
        nrf_gpio_pin_clear(GREEN_LED);
        nrf_delay_ms(500);
    }
}

void TxUART(uint8_t* buf)
{
    uint8_t j;

    j=0;
    while(buf[j] != 0)
    {
        sendbuffer[j] = buf[j];
        ++j;
        if (j > 20)
        {
          j = 20;
          break;
        }
    }
    NRF_UARTE0->TXD.MAXCNT = j;
    NRF_UARTE0->TASKS_STARTTX = 1;

    NRF_UARTE0->RXD.MAXCNT = 1;
    NRF_UARTE0->TASKS_STARTRX = 1;
    nrf_delay_ms(20);
    while(NRF_UARTE0->EVENTS_ENDTX != 1);
    while(NRF_UARTE0->EVENTS_ENDRX != 1);
}

void sendbytes(uint8_t which)
{
  uint8_t i;
  static uint8_t buf[32];
  float32_t max_value, scalar_factor;
  uint32_t  max_val_index;
  int16_t actual_value;

  if (which == 0)
  {
    // Search FFT max value in input array.
    arm_max_f32(m_fft_output_f32, 64, &max_value, &max_val_index);

    scalar_factor = max_value / 100.0f;

      for(i=0;(i<64);i++)
      {
          sprintf(buf,"%d,",(uint8_t)(m_fft_output_f32[i]/scalar_factor));
          TxUART(buf);
      }
   }
   else
   {

    for(i=0;(i<64);i++)
    {
        actual_value = p_rx_buffer[i+500]; 
        sprintf(buf,"%d,",actual_value);
        TxUART(buf);
     }
   }
   sendbuffer[0] = 13;
   sendbuffer[1] = 10;
   NRF_UARTE0->TXD.MAXCNT = 2;
   NRF_UARTE0->TASKS_STARTTX = 1;

}

void afunc(void)
{
    uint16_t fftLen = FFT_TEST_COMP_SAMPLES_LEN;  //currently 128
    arm_status ret;
    arm_rfft_fast_instance_f32 S;
    uint32_t i;
    uint8_t ifftFlag  = 0;


    for(i=0;(i<FFT_TEST_COMP_SAMPLES_LEN);i+=2)
    {
          m_fft_input_f32[i] = p_rx_buffer[i+400];      //magnitude part        
    }

    ret = arm_rfft_fast_init_f32(&S,fftLen);
    
    arm_rfft_fast_f32(&S,m_fft_input_f32,m_fft_output_f32,ifftFlag);

    //arm_cfft_f32(p_input_struct, p_input, m_ifft_flag, m_do_bit_reverse);
    // Calculate the magnitude at each bin using Complex Magnitude Module function.
    //arm_cmplx_mag_f32(p_input, p_output, output_size);


#ifndef FPU_INTERRUPT_MODE
        /* Clear FPSCR register and clear pending FPU interrupts. This code is base on
         * nRF5x_release_notes.txt in documentation folder. It is necessary part of code when
         * application using power saving mode and after handling FPU errors in polling mode.
         */
        __set_FPSCR(__get_FPSCR() & ~(FPU_EXCEPTION_MASK));
        (void) __get_FPSCR();
        NVIC_ClearPendingIRQ(FPU_IRQn);
#endif

}


/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void)
{
    ret_code_t              err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *)DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
    ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(void)
{
    ret_code_t    err_code;
    ble_advdata_t advdata;
    ble_advdata_t srdata;

    ble_uuid_t adv_uuids[] = {{LBS_UUID_SERVICE, uuid_type}};

    // Build and set advertising data
    memset(&advdata, 0, sizeof(advdata));

    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = true;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;


    memset(&srdata, 0, sizeof(srdata));
    srdata.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
    srdata.uuids_complete.p_uuids  = adv_uuids;

    err_code = ble_advdata_set(&advdata, &srdata);
    APP_ERROR_CHECK(err_code);
}


static uint32_t add_second_char(void)
{
    ble_gatts_char_md_t char_md;
    ble_gatts_attr_t    attr_char_value;
    ble_uuid_t          ble_uuid;
    ble_gatts_attr_md_t attr_md;

    memset(&char_md, 0, sizeof(char_md));

    char_md.char_props.read  = 1;
    char_md.char_props.write = 1;
    char_md.p_char_user_desc = NULL;
    char_md.p_char_pf        = NULL;
    char_md.p_user_desc_md   = NULL;
    char_md.p_cccd_md        = NULL;
    char_md.p_sccd_md        = NULL;

